In [1]:
import pandas as pd

In [2]:
customer_data = pd.read_csv("noahs-customers.csv")

customer_data.dtypes, customer_data.columns

(customerid        int64
 name             object
 address          object
 citystatezip     object
 birthdate        object
 phone            object
 timezone         object
 lat             float64
 long            float64
 dtype: object,
 Index(['customerid', 'name', 'address', 'citystatezip', 'birthdate', 'phone',
        'timezone', 'lat', 'long'],
       dtype='object'))

In [3]:
customer_data = customer_data[["name", "phone"]]

customer_data.head()

                    name         phone
0     Jacqueline Alvarez  315-377-5031
1           Julie Howell  680-537-8725
2        Christopher Ali  315-846-6054
3  Christopher Rodriguez  516-275-2292
4      Jeffrey Wilkinson  838-830-6960

In [4]:
customer_data_name_split = customer_data["name"].str.split()

customer_data["last_name"] = customer_data_name_split.apply(lambda a: a[-1]).str.lower()

customer_data.head()

                    name         phone  last_name
0     Jacqueline Alvarez  315-377-5031    alvarez
1           Julie Howell  680-537-8725     howell
2        Christopher Ali  315-846-6054        ali
3  Christopher Rodriguez  516-275-2292  rodriguez
4      Jeffrey Wilkinson  838-830-6960  wilkinson

In [5]:
customer_data = customer_data[["phone", "last_name"]]

customer_data.head()

          phone  last_name
0  315-377-5031    alvarez
1  680-537-8725     howell
2  315-846-6054        ali
3  516-275-2292  rodriguez
4  838-830-6960  wilkinson

In [6]:
customer_data["phone"] = customer_data["phone"].str.replace("-", '')

customer_data.head()

        phone  last_name
0  3153775031    alvarez
1  6805378725     howell
2  3158466054        ali
3  5162752292  rodriguez
4  8388306960  wilkinson

In [7]:
customer_data = customer_data[~(customer_data['phone'].str.contains(
    "0")) & ~(customer_data['phone'].str.contains("1"))]

customer_data.head()

         phone last_name
7   4356439792      boyd
9   9482246825       may
12  8386254866    watson
27  5854333925    dudley
38  8385354689    reeves

In [8]:
customer_data = customer_data[customer_data["last_name"].str.len() == customer_data["phone"].str.len()]

customer_data.head()

           phone   last_name
145   8382877269  richardson
207   8266362286  tannenbaum
1343  3479499226  mclaughlin
2080  4697368892  montgomery
3116  8387642679  cunningham

In [9]:
letters_to_int = {
    "a": 2, "b": 2, "c": 2, "d": 3,
    "e": 3, "f": 3, "g": 4, "h": 4,
    "i": 4, "j": 5, "k": 5, "l": 5,
    "m": 6, "n": 6, "o": 6, "p": 7,
    "q": 7, "r": 7, "s": 7, "t": 8,
    "u": 8, "v": 8, "w": 9, "x": 9,
    "y": 9, "z": 9
}

def translate(word):
    return "".join([str(letters_to_int[i]) for i in word])

In [10]:
customer_data = customer_data[customer_data["phone"] == customer_data["last_name"].apply(translate)]

          phone   last_name
207  8266362286  tannenbaum